### Pandas part 1

In [1]:
#installing library in VS code
pip install pandas

SyntaxError: invalid syntax (<ipython-input-1-5a584cb636bd>, line 2)

In [1]:
#Import the pandas library:
import pandas as pd

In [10]:
#Creating a pandas series from a list:
list_countries= ['United Kingdom', 'France', 'Mexico', 'Canada']
pd.Series (list_countries)

0    United Kingdom
1            France
2            Mexico
3            Canada
dtype: object

In [19]:
list_countries[0]

'United Kingdom'

In [12]:
#Creating a pandas series from a dictionary:
dic_pop= {'United Kingdom':68521968, 	'France':65273511, 'Mexico':128932753, 	'Canada':37742154}
pd.Series(dic_pop)

United Kingdom     68521968
France             65273511
Mexico            128932753
Canada             37742154
dtype: int64

In [3]:
#Import the numpy library:
import numpy as np

In [5]:
#Creating a pandas dataframe from a numpy array:
numpy_array= np.array ([ [5, 26, 3, 14], [31, 68, 53, 6], [2, 56, 8, 12] ])
pd.DataFrame (data=numpy_array)

    0   1   2   3
0   5  26   3  14
1  31  68  53   6
2   2  56   8  12

In [8]:
#Creating a pandas dataframe from a numpy array:
numpy_array= np.array ([ [5, 26, 3, 14], [31, 68, 53, 6], [2, 56, 8, 12] ])
row_index=["A", "B", "C"]
column_index= ['C0', 'C1','C2','C3']
pd.DataFrame (data=numpy_array, index=row_index, columns=column_index)

   C0  C1  C2  C3
A   5  26   3  14
B  31  68  53   6
C   2  56   8  12

In [8]:
#Capital S is important:
pd.Series(list_countries)

0    United Kingdom
1            France
2            Mexico
3            Canada
dtype: object

In [13]:
df=pd.read_csv("covid2.csv")

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 235 entries, 0 to 234
Data columns (total 67 columns):
 #   Column                                      Non-Null Count  Dtype
---  ------                                      --------------  -----
 0   iso_code                                    235 non-null    object
 1   continent                                   222 non-null    object
 2   location                                    235 non-null    object
 3   last_updated_date                           235 non-null    object
 4   total_cases                                 229 non-null    float64
 5   new_cases                                   229 non-null    float64
 6   new_cases_smoothed                          229 non-null    float64
 7   total_deaths                                223 non-null    float64
 8   new_deaths                                  223 non-null    float64
 9   new_deaths_smoothed                         223 non-null    float64
 10  total_cases_per_million                     228 non-null    float64
 11  new_cases_per_million                       228 non-null    float64
 12  new_cases_smoothed_per_million              228 non-null    float64
 13  total_deaths_per_million                    222 non-null    float64
 14  new_deaths_per_million                      222 non-null    float64
 15  new_deaths_smoothed_per_million             222 non-null    float64
 16  reproduction_rate                           191 non-null    float64
 17  icu_patients                                36 non-null     float64
 18  icu_patients_per_million                    36 non-null     float64
 19  hosp_patients                               33 non-null     float64
 20  hosp_patients_per_million                   33 non-null     float64
 21  weekly_icu_admissions                       17 non-null     float64
 22  weekly_icu_admissions_per_million           17 non-null     float64
 23  weekly_hosp_admissions                      29 non-null     float64
 24  weekly_hosp_admissions_per_million          29 non-null     float64
 25  total_tests                                 114 non-null    float64
 26  new_tests                                   63 non-null     float64
 27  total_tests_per_thousand                    114 non-null    float64
 28  new_tests_per_thousand                      63 non-null     float64
 29  new_tests_smoothed                          115 non-null    float64
 30  new_tests_smoothed_per_thousand             115 non-null    float64
 31  positive_rate                               109 non-null    float64
 32  tests_per_case                              106 non-null    float64
 33  tests_units                                 118 non-null    object
 34  total_vaccinations                          179 non-null    float64
 35  people_vaccinated                           177 non-null    float64
 36  people_fully_vaccinated                     179 non-null    float64
 37  total_boosters                              149 non-null    float64
 38  new_vaccinations                            79 non-null     float64
 39  new_vaccinations_smoothed                   179 non-null    float64
 40  total_vaccinations_per_hundred              179 non-null    float64
 41  people_vaccinated_per_hundred               177 non-null    float64
 42  people_fully_vaccinated_per_hundred         179 non-null    float64
 43  total_boosters_per_hundred                  149 non-null    float64
 44  new_vaccinations_smoothed_per_million       179 non-null    float64
 45  new_people_vaccinated_smoothed              177 non-null    float64
 46  new_people_vaccinated_smoothed_per_hundred  177 non-null    float64
 47  stringency_index                            134 non-null    float64
 48  population                                  234 non-null    float64
 49  population_density                          209 non-null    float64
 50  median_age                                  194 non-null    float64
 51  aged_65_older                               192 non-null    float64
 52  aged_70_older                               193 non-null    float64
 53  gdp_per_capita                              193 non-null    float64
 54  extreme_poverty                             125 non-null    float64
 55  cardiovasc_death_rate                       193 non-null    float64
 56  diabetes_prevalence                         203 non-null    float64
 57  female_smokers                              146 non-null    float64
 58  male_smokers                                144 non-null    float64
 59  handwashing_facilities                      95 non-null     float64
 60  hospital_beds_per_thousand                  171 non-null    float64
 61  life_expectancy                             220 non-null    float64
 62  human_development_index                     189 non-null    float64
 63  excess_mortality_cumulative_absolute        6 non-null      float64
 64  excess_mortality_cumulative                 6 non-null      float64
 65  excess_mortality                            6 non-null      float64
 66  excess_mortality_cumulative_per_million     6 non-null      float64
dtypes: float64(62), object(5)
memory usage: 123.1+ KB

In [11]:
#Create a dataframe from a list:
pd.DataFrame(list_countries)

                0
0  United Kingdom
1          France
2          Mexico
3          Canada

In [14]:
#If we want to add a name to the previous column:
pd.DataFrame(data=list_countries, columns=["Country"])

          Country
0  United Kingdom
1          France
2          Mexico
3          Canada

In [15]:
#Create a dataframe from a dictionary:
pd.DataFrame(dic_pop, index=[0,1,2,3])

   United Kingdom    France     Mexico    Canada
0        68521968  65273511  128932753  37742154
1        68521968  65273511  128932753  37742154
2        68521968  65273511  128932753  37742154
3        68521968  65273511  128932753  37742154

In [2]:
#Data importation:
dataframe= pd.read_csv("datacensus.csv")
dataframe
#csv file must be saved in same folder as script

          Country   Population
0  United Kingdom   68521968.0
1          France   65273511.0
2          Mexico  128932753.0
3          Canada   37742154.0
4            Peru          NaN

In [7]:
dataframe.loc[4:5]

  Country  Population
4    Peru         NaN

In [6]:
dataframe.loc[4:5].fillna(1000000)

  Country  Population
4    Peru   1000000.0

In [11]:
#Data exploration:
dataframe.head(1)

          Country  Population
0  United Kingdom  68521968.0

In [ ]:
dataframe.head (2)

In [14]:
dataframe.tail(2)

  Country  Population
3  Canada  37742154.0
4    Peru         NaN

In [15]:
#returns number of rows and columns in a tuple:
dataframe.shape

(5, 2)

In [16]:
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Country     5 non-null      object
 1   Population  4 non-null      float64
dtypes: float64(1), object(1)
memory usage: 208.0+ bytes

In [19]:
#Data selection (columns) returns as a dataframe:
dataframe[['Country']]

          Country
0  United Kingdom
1          France
2          Mexico
3          Canada
4            Peru

In [17]:
#Data selection (columns) returns as a Series:
dataframe['Country']

0    United Kingdom
1            France
2            Mexico
3            Canada
4              Peru
Name: Country, dtype: object

In [18]:
type(dataframe['Country'])

pandas.core.series.Series

In [20]:
type(dataframe[['Country']])

pandas.core.frame.DataFrame

In [20]:
#Data selection (rows):
dataframe.loc[0, 'Country']

'United Kingdom'

In [24]:
#Another way to select column variable:
dataframe.Country

0    United Kingdom
1            France
2            Mexico
3            Canada
4              Peru
Name: Country, dtype: object

In [ ]:
#iloc search by row and column
dataframe.iloc[2,1]

In [ ]:
dataframe.loc[0]

In [ ]:
dataframe.iloc[0]

In [ ]:
dataframe.loc[2:4]

In [ ]:
dataframe.iloc[2:4]

In [22]:
dataframe.iloc[0:3].isnull()

   Country  Population
0    False       False
1    False       False
2    False       False

In [ ]:
dataframe.iloc[0:3].fillna()

In [ ]:
dataframe.iloc[0:3, 0:1]

In [27]:
#function evaluate each rows on the Country column for the presence of the string 'France
dataframe['Country'].str.contains('France')

0    False
1     True
2    False
3    False
4    False
Name: Country, dtype: bool

In [ ]:
#will return all data related to the string 'France'. 
dataframe[dataframe['Country'].str.contains('France')]

In [ ]:
#How to rename a column name:
dataframe.rename(columns={'Country': 'COUNTRY'})

In [28]:
#How to reassign a new row index:
new_index=['UK','FR','MX','CA','PR']
new_dataframe= dataframe.copy()
new_dataframe.index=new_index  # assign a new index

In [ ]:
new_dataframe

In [ ]:
dataframe

In [ ]:
#How to remove a specific column:
dataframe_2= dataframe.drop('Population', axis=1)
dataframe_2

In [ ]:
#How to remove a specific row:
dataframe_3= dataframe.drop(4, axis=0)
dataframe_3

In [ ]:
dataframe['Country'].str.replace('United Kingdom', 'UK')

In [ ]:
#Handling missing data:
dataframe['Population']=dataframe['Population'].fillna(0)
dataframe

In [ ]:
#Remving missing values from the whole dataset:
dataframe=dataframe.fillna(0)

In [32]:
dataframe.isnull()

   Country  Population
0    False       False
1    False       False
2    False       False
3    False       False
4    False       False

In [33]:
dataframe["Country"].isnull()

0    False
1    False
2    False
3    False
4    False
Name: Country, dtype: bool